In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [2]:
df=pd.read_csv('car.csv')

In [3]:
df.head()

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

In [5]:
df.describe()

              name company  year          Price  kms_driven fuel_type
count          892     892   892            892         840       837
unique         525      48    61            274         258         3
top     Honda City  Maruti  2015  Ask For Price  35,000 kms    Petrol
freq            13     235   117             35          30       440

## Data quality issues

column ==> name
- we will try to make this good feature by just keeping first three letters

column ==> year
- clean the massy data tomuch unique values
- convert obj to int

column ==> Price
- column contains 'Ask For Price' value 
- convert obj to int

column ==> kms_driven
- remove 'km' fromt he values
- remove Petrol values
- convert obj to int

column ==> fuel_type
- handle nan values

### Data Cleaning

taking backup of data

In [6]:
backup=df.copy()

before cleaning df shape

In [7]:
df.shape

(892, 6)

#### handling year column

In [8]:
df['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '...', '150k', 'TOUR', '2003', 'r 15', '2004', 'Zest', '/-Rs',
       'sale', '1995', 'ara)', '2002', 'SELL', '2001', 'tion', 'odel',
       '2 bs', 'arry', 'Eon', 'o...', 'ture', 'emi', 'car', 'able', 'no.',
       'd...', 'SALE', 'digo', 'sell', 'd Ex', 'n...', 'e...', 'D...',
       ', Ac', 'go .', 'k...', 'o c4', 'zire', 'cent', 'Sumo', 'cab',
       't xe', 'EV2', 'r...', 'zest'], dtype=object)

In [9]:
df=df[df['year'].str.isnumeric()]

In [10]:
df['year'].unique()

array(['2007', '2006', '2018', '2014', '2015', '2012', '2013', '2016',
       '2010', '2017', '2008', '2011', '2019', '2009', '2005', '2000',
       '2003', '2004', '1995', '2002', '2001'], dtype=object)

In [11]:
df['year']=df['year'].astype('int32')

In [12]:
df.year.dtype

dtype('int32')

In [13]:
df.shape

(842, 6)

In [14]:
print('row removed :',892-842)

row removed : 50

#### handling price column

In [15]:
df['Price'].describe()

count               842
unique              273
top       Ask For Price
freq                 23
Name: Price, dtype: object

In [16]:
df=df[df['Price']!='Ask For Price']

In [17]:
df['Price']=df['Price'].str.replace(',','').astype('int')

In [18]:
df['Price'].dtype

dtype('int32')

In [19]:
df.shape

(819, 6)

#### handling  kms_driven column

In [20]:
df['kms_driven']

0        45,000 kms
1            40 kms
3        28,000 kms
4        36,000 kms
6        41,000 kms
           ...
886    1,32,000 kms
888      27,000 kms
889      40,000 kms
890          Petrol
891          Petrol
Name: kms_driven, Length: 819, dtype: object

In [21]:
df['kms_driven']=df['kms_driven'].str.replace('kms','')

In [22]:
df['kms_driven']=df['kms_driven'].str.replace(',','')

In [23]:
df=df[df['kms_driven'] != 'Petrol']

In [24]:
df['kms_driven']=df['kms_driven'].astype('int')

In [25]:
df['kms_driven']

0       45000
1          40
3       28000
4       36000
6       41000
        ...
883     50000
885     30000
886    132000
888     27000
889     40000
Name: kms_driven, Length: 817, dtype: int32

In [26]:
df.shape

(817, 6)

####  handle fuel_type column

In [27]:
df['fuel_type'].unique()

array(['Petrol', 'Diesel', nan, 'LPG'], dtype=object)

In [28]:
df=df[~df['fuel_type'].isna()]

In [29]:
df.shape

(816, 6)

#### handle name column

In [30]:
df['name']

0        Hyundai Santro Xing XO eRLX Euro III
1                     Mahindra Jeep CL550 MDI
3      Hyundai Grand i10 Magna 1.2 Kappa VTVT
4            Ford EcoSport Titanium 1.5L TDCi
6                                   Ford Figo
                        ...
883                Maruti Suzuki Ritz VXI ABS
885                 Tata Indica V2 DLE BS III
886                      Toyota Corolla Altis
888                       Tata Zest XM Diesel
889                        Mahindra Quanto C8
Name: name, Length: 816, dtype: object

In [31]:
df['name']=df['name'].str.split(' ').str[0:3].str.join(' ')

In [32]:
df['name']

0         Hyundai Santro Xing
1         Mahindra Jeep CL550
3           Hyundai Grand i10
4      Ford EcoSport Titanium
6                   Ford Figo
                ...
883        Maruti Suzuki Ritz
885            Tata Indica V2
886      Toyota Corolla Altis
888              Tata Zest XM
889        Mahindra Quanto C8
Name: name, Length: 816, dtype: object

### Checking clean data

In [33]:
df.shape

(816, 6)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 816 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        816 non-null    object
 1   company     816 non-null    object
 2   year        816 non-null    int32
 3   Price       816 non-null    int32
 4   kms_driven  816 non-null    int32
 5   fuel_type   816 non-null    object
dtypes: int32(3), object(3)
memory usage: 35.1+ KB

In [35]:
df.describe()

              year         Price     kms_driven
count   816.000000  8.160000e+02     816.000000
mean   2012.444853  4.117176e+05   46275.531863
std       4.002992  4.751844e+05   34297.428044
min    1995.000000  3.000000e+04       0.000000
25%    2010.000000  1.750000e+05   27000.000000
50%    2013.000000  2.999990e+05   41000.000000
75%    2015.000000  4.912500e+05   56818.500000
max    2019.000000  8.500003e+06  400000.000000

In [36]:
df.describe().apply(lambda s: s.apply('{0:.2f}'.format))

          year       Price kms_driven
count   816.00      816.00     816.00
mean   2012.44   411717.62   46275.53
std       4.00   475184.42   34297.43
min    1995.00    30000.00       0.00
25%    2010.00   175000.00   27000.00
50%    2013.00   299999.00   41000.00
75%    2015.00   491250.00   56818.50
max    2019.00  8500003.00  400000.00

In [37]:
df.describe()['Price'].apply(lambda x: format(x, '.2f'))

count        816.00
mean      411717.62
std       475184.42
min        30000.00
25%       175000.00
50%       299999.00
75%       491250.00
max      8500003.00
Name: Price, dtype: object

In [38]:
df.describe(include=['O'])

                       name company fuel_type
count                   816     816       816
unique                  254      25         3
top     Maruti Suzuki Swift  Maruti    Petrol
freq                     51     221       428

In [39]:
df.reset_index(drop=True,inplace=True)

In [40]:
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
811      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
812          Tata Indica V2      Tata  2009  110000       30000    Diesel
813    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
814            Tata Zest XM      Tata  2018  260000       27000    Diesel
815      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[816 rows x 6 columns]

In [42]:
# df.to_csv('cleaned_car.csv',index=False)